src/test/resources/xml/sum-soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header />
  <soapenv:Body>
    <ps:SumProcessRequest xmlns:ps="http://www.uncertweb.org/ProcessingService">
      <ps:A>4.002</ps:A>
      <ps:B>1000</ps:B>
    </ps:SumProcessRequest>
  </soapenv:Body>
</soapenv:Envelope>